{"data":[{"attributes":{"content":"So, I just uploaded the last of the tutorials for May. That's 3 tutorials for May. I think that's a really solid amount to start us off with. The Kirby model I am working with for this series of tutorials is actually entirely recorded, so I'll probably upload that in video form at some point too.<p>Whether or not I'll narrate it is still up in the air and will probably depend on what you guys prefer.</p><p>And that was just May! Imagine what June will bring. Actually, don't imagine because you're the ones that get to decide. This post is public, but I'll putting up a <strong>Supporter.EXE </strong>and up only poll post soon that will decide what I'll be working on this month. You can still change your pledge to have your say!</p><p>I'm also working on some more freebies to put up for download on the patreon (for patrons) regardless so keep your eyes peeled!</p><p><img src=\"https://tcrf.net/images/archive/a/a5/20180601193312%21PokeGoldDemo-front_172.png\"></p><p><br></p>","min_cents_pledged_to_view":0,"post_type":"text_only","published_at":"2018-06-04T00:30:59+00:00","title":"It's June!","url":"https://www.patreon.com/posts/its-june-19229646"},"id":"19229646","relationships":{"attachments":{"data":[]},"campaign":{"data":{"id":"1153441","type":"campaign"},"links":{"related":"https://www.patreon.com/api/campaigns/1153441"}},"user_defined_tags":{"data":[{"id":"user_defined;announcement","type":"post_tag"}]}},"type":"post"},{"attributes":{"content":"  <strong>What you will need:</strong><ul> <li><a href=\"https://www.blender.org/download/\" rel=\"nofollow noopener\" target=\"_blank\">Blender</a></li> <li>A 3-button mouse </li> <li>Preferably a keyboard with a numpad</li> <li>An art application that supports layers and transparency</li> <li>Your model from part 2!</li></ul><p>The attachment has the textured and rigged and animated Kirby model ready for use. But, of course, it's better practice if you do this with your own model!</p><h3>Intro</h3><p>So, that wonderful model we made last time... let's add a touch of color (just like the intro to Kirby's Adventure).</p><p><img src=\"https://i.imgur.com/tzp5nG2.png\"></p><p><em>The result of part 2 (for me). Kirby should still be mirrored at this stage</em></p><p>First things first, let's talk about unwrapping. To be able to texture a model, we must first somehow translate a model to a 2D surface. There are ways to paint on top of a 3D model but this just means that the software you're using is doing this behind the scenes.</p><p>Unwrapping a model means, basically taking it apart enough that you can squish it to be flat (after which we cover this flat surface with paint). To illustrate what I mean, let's try it with a simple cube.</p><p><img src=\"https://i.imgur.com/OHjhk04.png\"></p><p><em>A simple unwrapped cube</em></p><p>This cube might remind you of paper craft you may have done at some other point in your life, because that's exactly what it is! It's paper craft in reverse! You first model the figure you want and then you cut it up into bits that make sense to lay flat. The more you can keep connected, the better.</p><p><img src=\"https://i.imgur.com/9I8Ypi9.png\"></p><p><br></p><p>In this case, the entire cube is still connected, it's just unwrapped in such a way that you're easily able to paint the whole thing without having to separate the bits. This won't be possible for everything, of course, especially for spherical objects this'll be tough (which Kirby mostly is).</p><p>Unwrapping is done by pressing the <strong>U key in Edit Mode, then selecting Unwrap</strong>. Note that there are other ways of unwrapping, but the main modus operandus will be using the regular unwrap. </p><p>But how did I tell blender to cut along those lines instead of just doing whatever it wants? The key to that is \"seams\". </p><h3>The concept of Seaming</h3><p><em>(Note: I don't think \"seaming\" is actually a word, but that's just what I call this process)</em></p><p>Seaming is what I call the act of adding seams to a model, either while modeling or afterwards. I think it's a good practice to seam a model while you're putting it together, but you don't always know what parts you want to be separate in the texture in advance. </p><p>Seams will basically tell Blender while unwrapping \"Stop Here\". This is, for example, useful for making sure you'll be able to color separate parts of a low poly model properly.</p><p><img src=\"https://i.imgur.com/pbGSdNP.png\"></p><p><em>Seams on solid and the textured modeled (from my Block Man MM11 model)</em></p><p>Seams show up as <strong>red lines</strong> on your model in both texture and solid display in Edit Mode. And as such, this outline red strip on the model became this when unwrapped:</p><p><img src=\"https://i.imgur.com/h4BQj5Y.png\"></p><p>This can give you extremely specific control over the coloring of parts of your model to the exact face if you want that. </p><p>Now, let's apply what we know so far...</p><h3>How to actually seam</h3><p>So, Kirby has about 3 parts that we'll want to paint/unwrap. Assuming he's properly mirrored still there's the head, the hand and the foot.</p><p>By properly mirrored I mean that the Mirror Modifier has to still be enabled and in place and not applied (or that only half of Kirby has actually been modeled). Why? Because we only want to texture half of something that's entirely symmetrical.</p><p><img src=\"https://i.imgur.com/xD09NZS.png\"></p><p>So, we're only going to seam the right hand side of the Kirby model. For any model you will not want to texture anything you don't have to twice.</p><p>First up, how do we add a seam? You can add seams in any selection mode, but most commonly I use the edge select mode. </p><p>To mark an edge as a seam:</p><ul> <li>Select an edge (or a loop of edges with <strong>ALT key + Right Click</strong>)</li> <li>Press <strong>CTRL + E</strong></li> <li>Click <strong>Mark Seam</strong> (on repeat markings, you can just press Enter)</li></ul><p>This also works on faces and multiple vertices. To clear a seam you can repeat the same process except you click <strong>Clear Seam</strong> in the last step.</p><p>Seams also affect the linked select function of Blender (CTRL + L). It makes it so CTRL + L doesn't penetrate the barriers set by the seams. So if you have a connected arm and hand and you want to only select the hand you might put a seam right around the wrist and linked select the hand for this effect.</p><p><img src=\"https://i.imgur.com/VUgrI3j.png\"></p><p>In the above example I selected the arm and used Linked Select. There were seams at the bracelet and where the shoulder begins, these limit the extent of this functions selection. </p><p>You can have linked select ignore this by either being in edge select mode or by unticking it in the bottom left corner after using linked select.</p><h3>Seaming Kirby</h3><p>Now that we know how to mark seams and that we want to seam as little as humanly possible... let's get to work on Kirby! Another great tip for texturing (and maybe modeling in general) is to <strong>delete everything that is not visible in the end product</strong>. Delete ends of cylinders that are stuck in other things (not visible), delete the insides of things nobody will ever see! Why? Because if you don't, you'll have to texture it and rig it and it'll just be extra work for you, with no gain whatsoever.</p><p>First off, as the model is mirrored it should be cut down cleanly through the middle. I usually mark that as a seam as well.</p><p><img src=\"https://i.imgur.com/kjSsJdZ.png\"></p><p>Seaming a hemisphere I usually seam the open side (so the line through the middle here).</p><p>Secondly, you'll want to cut out the face like this as well. It's just a good idea to do for any place you'll want to draw eyes/mouths.</p><p><img src=\"https://i.imgur.com/G8efh64.png\"></p><p><br></p><p>(Remember that you can hide things by using ALT + H while selecting anything. This is useful for when you want to seam things that are obscured by other things)</p><p>You can do the same for the hand, as that is a sort of squished hemisphere stuck in the side of the head.</p><p><img src=\"https://i.imgur.com/IBmMa2V.png\"></p><p>However, the hand could use a little more finesse. We'll use a technique here which is most often used when unwrapping cylinders. The open side is one side of the cylinder, with the spherical end being the other end of the cylinder. You make a small circle in the smallest loop of the sphere, we mark this as a seam also and make a cut along the length of the cylinder.<br><br>On unwrap, we'll achieve this shape</p><p><img src=\"https://i.imgur.com/BwrsJo6.png\"></p><p>The bottom bit is the side of our \"cylinder\" (gets wider near the end) and the top circle is the circle we marked along (at his \"fingertip\").</p><p>And last up are the feet! Or, actually, just one foot.</p><p><img src=\"https://i.imgur.com/v5gR49I.png\"></p><p>The strategy is unchanged. We select the smallest loop at the bottom of the foot, mark that as a seam. Do the same for the top and then we add a cut that goes from the top circle to the bottom circle on the side (which side doesn't matter).</p><p><img src=\"https://i.imgur.com/3gK8Rv2.png\"></p><p>Now we've seamed everything on our Kirby model. It's time actually unwrap!</p><p>When done with seaming your Kirby should look something like this (depending on the mode you're in).</p><p><img src=\"https://i.imgur.com/p9AdKKd.gif\"></p><p><br></p><h3>Unwrapping</h3><p>Unwrapping is done (as described above) by selecting what you want to unwrap in Edit Mode (doesn't have to be whole model, you can unwrap selectively) and pressing the '<strong>U' key -&gt; Enter key</strong>.</p><p>Let's view the result of our unwrapping! This requires you to open up the UV/Image Editor panel in Blender. There's also a Blender preset to get into a proper setup called \"UV Editing\". In Blender Overview #1 I explain in detail how to get into these menus but here's a summary:</p><p><img src=\"https://i.imgur.com/HR4Ix3p.gif\"></p><p><em>Woah! A gif!</em></p><p>It's pretty speedy, but the option you want is called \"UV/Image Editor\". In Edit Mode you'll be able to see your model's UV map here. Blender automatically tries to fit everything as tightly as mathematically possible, but that doesn't always mean that's what we want.</p><p>For example, the piece that represents Kirby's face needs far more detail than the underside of his shoe. </p><p>The usual tools for scaling, moving and rotating still work in the UV Editing window! To figure out which unwrapped part corresponds to which part on the model we can enable a feature that will synchronize the selection between the 3D View and the UV!</p><p>In other words, if you enable this selecting something in the 3D View will also select it on the UV map.</p><p><img src=\"https://i.imgur.com/A2KInav.png\"></p><p>This can be found at the bottom of the UV Editing menu.</p><p><img src=\"https://i.imgur.com/E2HZ6Ci.png\"></p><p>So, select any part of your Kirby model and it should now light something up on the UV side.</p><p>Using this, give the face some space and size. If you want Blender, to once again try to fit everything together as well as possible there's an option for this as well: <strong>UVs -&gt; Pack Islands</strong>. This option will not scale the islands you've selected. If you change your model at all and you want to try unwrapping again, just select what you wanted unwrapped in the 3D View and press the 'U' key once again.</p><p>The final UV Layout I settled on is as follows:</p><p><img src=\"https://i.imgur.com/JoT9dkI.png\"></p><p>I made the arms and feet all quite small and the face quite large. In my reference the arms and feet all are monochrome with the face being the only very detailed part. So, now that we have a fully unwrapped model let's move on to the next phase!</p><h3>Texture Painting</h3><p>We enter the last phase of this tutorial... actually painting a texture! Now you might be wondering, we've got all this unwrapped crap. How do we get a texture on there? And how do I align my texture perfectly to the UV map?</p><p>There are a few steps to this process:</p><ul> <li>Importing the image you want to use a texture</li> <li>Making sure the model uses it as its texture</li> <li>Exporting the UV map</li> <li>Setting up your 2D art application</li> <li>Exporting your texture</li> <li>Refreshing the texture in Blender</li></ul><p>You'll be repeating those last two steps quite often until you're 100% happy. The other steps happen once per model, usually. If you change your UV map in a way that you'd like to see reflected in your template while painting you'll want to export the UV map again. Let's go through each step one-by-one. </p><p><strong>Importing the image</strong> is done by pressing Image -&gt; Open Image. Selecting your image in the file dialog will add it to the list of images associated with your model. </p><p>Now, we <strong>make sure the model uses it as its actual texture</strong>. In Edit Mode, select the model (all of it, for our case), then in the drop down bar next to the menu in the UV Editing window select the image you want to apply. If you want your model to use different textures for different parts just select different parts of the model and link those to different image files.</p><p><strong>Exporting the UV map</strong> is very simple, you can find it under UVs -&gt; Export UV Layout. Here you can then set the resolution of the exported UV map (it'll be auto-set to whatever the resolution of the image you imported was). </p><p>After this, <strong>open the file in any 2D art application</strong> that supports both layers and transparency. Open up the exported UV layout as your top-most layer. Under this, have a layer on which you're actually painting your texture.</p><p><img src=\"https://i.imgur.com/ZnB4KV3.png\"></p><p><em>Image from </em><a href=\"https://www.patreon.com/posts/how-to-make-your-17809985\"><em>NormalNavi tutorial</em></a> </p><p>When you're done with what you're painting, you'll want to<strong> export it back into Blender</strong>. Blender won't take that layered image so make sure you only save and replace that texture layer. Replace the file you imported into Blender with this new version. </p><p>Lastly, to <strong>refresh the texture in Blender itself</strong>. Have your mouse over your image in the UV Editing window and press ALT key + 'R' key. It should visibly have refreshed the image immediately. If not, make sure you saved over the correct image when you were saving your texture.</p><p><img src=\"https://i.imgur.com/9xdrej6.png\"></p><p>Whenever you change the texture, you'll want to save over the one Blender considers the model's texture and then refresh it in Blender.</p><p>The next part somewhat depends on what you're working on, but for my interpretation of Kirby this is how I colored everything:</p><p><img src=\"https://i.imgur.com/cJfy8PK.png\"></p><p>As you can see, the face got a ton of space.</p><p><img src=\"https://i.imgur.com/tNQjK4s.png\"></p><p>And this is why! A very simple texture, but the result is enjoyable!</p><p><img src=\"https://i.imgur.com/w4U9wLk.png\"></p><p>It took me about 20 minutes to get to this point on my end, but don't worry if I took you a lot longer and, perhaps, multiple attempts. The important part is that you're seeing a lot of Blender and becoming more comfortable with it. I also hope you're happy with your Kirby!</p><p>My model is unshaded, but that doesn't mean yours has to be! Experiment with your texture! </p><p>Now that you're done texturing, you can apply the mirror modifier in the modifier menu to prepare for the next phase.</p><p><img src=\"https://i.imgur.com/CSSEJ1L.png\"></p><p>With the next phase being... rigging!</p><h3>Bonus</h3><p>As last time, it's time for our bonus section! Outlines!</p><p><img src=\"https://i.imgur.com/Fa88eeb.png\"></p><p>One way of getting outlines to happen is by duplicating your model, making it a bit larger and then inverting the normals. Then you color it to the color you want your outline to be. That's the technique I'm using here.</p><p><img src=\"https://i.imgur.com/7wzyB3V.gif\"></p><p><em>It took me 35 minutes to compress this gif enough to not be 20 MB</em></p><p>Let's take it step by step:</p><ul> <li>Take your model and duplicate it (Shift + 'D' key). Blender will automatically select the duplicate after this.</li> <li>Enlarge this duplicate a bit (as thick as you want your outline to be). The way you want to enlarge this can either be with median point or with individual origins. The point is to envelop your original model.</li> <li>Take that outside that's been selected and invert the normals. Inverted normals mean that the model will become see-through, basically. Press the Spacebar -&gt; type \"Flip Normals\" and press the Enter key.</li> <li>In the UV map, make sure that this duplicated part is purely colored the color you want your outline to be. Just dragging and dropping will do.</li></ul><p><img src=\"https://i.imgur.com/7iQxbFG.png\"></p><p>The final texture. The highlighted part is the duplicated version for the outline. Make sure backface culling is set on (in the display menu in the 3D View).</p><p>If you're a bit lost on where all these menus are, be sure to consult <a href=\"https://www.patreon.com/posts/blender-overview-18580614\">Blender Overview #1</a> </p><h3>Outro</h3><p>And that's it! Now you have all the knowledge you need to make this wonderful Kirby model!</p><p><img src=\"https://i.imgur.com/soLtchZ.gif\"></p><p>Except for that animation! And that's exactly what we'll be touching on next time. Rigging and after that animation.</p><p>The attached model contains a rigged and animated Kirby model. Next tutorial I'll explain how to make that work on your own models!</p>","min_cents_pledged_to_view":1,"post_type":"text_only","published_at":"2018-06-04T00:03:29+00:00","title":"Blender Overview #3","url":"https://www.patreon.com/posts/blender-overview-19189533"},"id":"19189533","relationships":{"attachments":{"data":[{"id":"2255444","type":"attachment"}]},"campaign":{"data":{"id":"1153441","type":"campaign"},"links":{"related":"https://www.patreon.com/api/campaigns/1153441"}},"user_defined_tags":{"data":[{"id":"user_defined;3d model","type":"post_tag"},{"id":"user_defined;art","type":"post_tag"},{"id":"user_defined;texture","type":"post_tag"},{"id":"user_defined;tutorial","type":"post_tag"}]}},"type":"post"},{"attributes":{"content":"Hi everyone! Especially you new patrons, thanks for joining us. I have a small update on what's coming up soon (next week/until June 1st).<p>First off, I've reworked the two older tutorials a little bit based on the feedback I got from the feedback post. So, if you have any other questions or more specific feedback be sure to let me know. Moving forward I'll try to add more details to the tutorials, especially around trickier steps.</p><p>On the topic of tutorials, the next tutorial coming up will be online near the start of this week! So probably tomorrow/Tuesday. This time the topic will be...</p><p><img src=\"https://i.imgur.com/2EB41GF.png\"></p><p><em>...texturing</em>!</p><p>Also, we broke $100 a month! Which is freakin' awesome! I never thought the support would be this strong and I'm extremely grateful. It's motivated me even more to put out quality stuff for you guys. </p><p><img src=\"https://i.imgur.com/tyzYnJR.gif\"></p><p><br></p><p>This brings me to my next point... what happens next month? Well, that's what I want to ask you guys! As usual (this is the second time, actually) at the start of next month I'll run a poll asking what you guys want to see for that month, starting at the <strong>Supporter.EXE tier</strong> you get to vote on those polls! </p><p>The two main options are either Modeling (a model that is then uploaded on the patreon as well) or Tutorial (I continue the tutorial series/add a tutorial on a specific topic (like PS1 textures)). </p><p>If modeling is chosen I then put up another poll with the selection of models that can be chosen from this month. Here's a teaser for next month's options:</p><p><img src=\"https://i.imgur.com/FC2N69t.png\"></p><p><br></p><p>Now, for the very, very, very last point: </p><p>I'll be at<strong> London MCM Comic-Con on Saturday (May 26th)</strong>, so if anyone wants to meet up and say hi or something, just let me know! I'm totally down for that.</p><p>Thanks for all the support and I hope to hear from you guys in the comments!</p>","min_cents_pledged_to_view":0,"post_type":"text_only","published_at":"2018-05-21T23:05:30+00:00","title":"Coming up!","url":"https://www.patreon.com/posts/coming-up-18914382"},"id":"18914382","relationships":{"attachments":{"data":[]},"campaign":{"data":{"id":"1153441","type":"campaign"},"links":{"related":"https://www.patreon.com/api/campaigns/1153441"}},"user_defined_tags":{"data":[{"id":"user_defined;news","type":"post_tag"}]}},"type":"post"},{"attributes":{"content":"Hey guys! I've been wanting to know what you guys think of the tutorials so far, so mind answering this poll for me? <p>What do you think of the tutorials so far (NormalNavi recolor/Blender Overview #1/2)? Especially the amount of detail per step.</p><p><br></p><p>Also, feel free to stick any feedback about the tutorials in the comments! I'm new to this stuff so I wanna learn as much about how I can improve as I can!</p>","min_cents_pledged_to_view":1,"post_type":"poll","published_at":"2018-05-12T20:41:34+00:00","title":"Feedback Poll!","url":"https://www.patreon.com/posts/feedback-poll-18756865"},"id":"18756865","relationships":{"attachments":{"data":[]},"campaign":{"data":{"id":"1153441","type":"campaign"},"links":{"related":"https://www.patreon.com/api/campaigns/1153441"}},"user_defined_tags":{"data":[]}},"type":"post"},{"attributes":{"content":" <strong>What you will need:</strong><ul> <li><a href=\"https://www.blender.org/download/\" rel=\"nofollow noopener\" target=\"_blank\">Blender</a></li> <li>A 3-button mouse </li> <li>Preferably a keyboard with a numpad</li> <li>Something to model!</li></ul><p> The attachment has a finished Kirby model and texture that you can use as reference. It also has a reference image, but any good front-view image will do the job. </p><p><em>(In fact, I'd really dig it if you did this tutorial with a different model of Kirby)</em></p><h3><strong>Intro</strong></h3><p>This is it, the time has finally come for us to make a 3D model together. From (almost) nothing. I honestly think the best way to learn modeling is to start small, so we're going to start very small. Small and friend shaped.</p><p><img src=\"https://i.imgur.com/52ZX1qn.png\"></p><p>Kirby! Kirby is an excellent candidate to start with. He's simple, made up out of almost basic shapes (but not quite) and he's also impossible to dislike. So when Blender gets you down, you can just look at his smile and your mood will recover.</p><p>Two of the key secrets to modeling is A. Good reference and B. Dealing with poor reference. So, keeping that in mind let's try to use this reference to the fullest. In fact, I recommend that you get a bunch of pictures up on a second screen or a phone just to get a general feel of what he's supposed to look like from all angles. </p><p>Let's discuss the steps we'll take from 0 to a complete model:</p><ul> <li>Setting up the reference</li> <li>Creating shapes (Kirby's head)</li> <li>Using modifiers</li> <li>Modifying shapes (Kirby's arms and feet)</li></ul><p>UV unwrapping and texturing will be in the next tutorial and Rigging and animating in the tutorial after that! Basically, I think it'd make for a much too long and tiring tutorial if I did all 3 main \"steps\" in one go and I try to make these tutorials for humans, not 3D-modeling-learning-robots.</p><p>So, let's begin!</p><h3>Step 1: Setting up the reference!</h3><p>First things first, if you've got the default Blender start up file you'll be seeing a cube, a camera and a light. Press A to select all and the Del key to remove all of it. </p><p>Also, feel free to change the perspective to ortho by pressing Numpad 5. The rest of the Numpad keys and their functions are explained in the previous tutorial.</p><p><img src=\"https://i.imgur.com/w6KrYDw.png\"></p><p>We now have an empty work space. If your cursor isn't already in the middle, press SHIFT + S to move the cursor. Select the Cursor to Center option. The red and white cursor can be moved by clicking around and new stuff you spawn will be spawned right on top of that lil' cursor. </p><p>Next, let's add that reference image. </p><p>Adding new objects is done by press SHIFT + A in the 3D view in Object Mode (also works in Edit Mode, but we want to make an entirely new object).</p><p><img src=\"https://i.imgur.com/7Q3lNzo.png\"></p><p>This'll create a new \"Empty\" object. Select it (if it's not selected) and look to the properties window to the right.</p><p><img src=\"https://i.imgur.com/3KzeUup.png\"></p><p>Click the small icon (that is highlighted blue in the above image) that looks like a tripod. This'll open the specific properties pertaining to its status as an \"Empty\". In this case, it lets you set the image that it'll display for you.</p><p>Press that \"Open\" button and navigate to your reference image. </p><p><img src=\"https://i.imgur.com/UkNSW2F.png\"></p><p>In Blender's 3D space \"Up\" is Z, \"Back/Forth\" is Y and \"Left/Right\" are X. This applies to all forms of movement in Blender.</p><p>Rotate the model by 90 degrees on the X axis (R key for rotate, X key for X-axis only and type \"90\" for an exact rotation). Push it back a little (G for movement and lock to the Y axis with Y key). And there you have it, your reference.</p><p>Get a top view with Numpad 7 and press SHIFT + D to duplicate the object. Blender will automatically select the duplicate version. Now, Blender has 5 different ways of choosing a \"pivot point\" for anything you're messing with, pivot point means the \"central point\" around which everything happens. So for example rotation would happen around the pivot. </p><p>By default it is set to Median Point, but we're gonna look at the other options real quick before using one of them.</p><p><img src=\"https://i.imgur.com/Pi3ymXb.png\"></p><p>They're mostly self explanatory, but the 3 most important ones (in my usage) are <strong>Median Point </strong>(centers on the middle of most \"objects\", including edges/vertices), <strong>Individual Origins </strong>(center of each individual object)<strong>, 3D Cursor</strong> (right where the cursor is).</p><p>For this I want you to set it to 3D Cursor. Make sure the cursor is center, otherwise re-center it. Then rotate ('R' key) it on the Z-axis ('Z' key) 90 degrees (type '90' while rotating). It should show up like this:</p><p><img src=\"https://i.imgur.com/LeHFdeq.png\"></p><p>Now you have two images of Kirby we can model over! Remember, look at it from side with Numpad 3 and from the front with Numpad 1.</p><h3>Step 2:  Creating shapes!</h3><p>Now, let's actually start modeling this guy! First off, make sure your cursor is centered. </p><p>We already used the SHIFT + A function before, but this time go for \"Mesh\". A Mesh is a collection of edges and faces, so, a shape!</p><p>There's a pretty wide array of shapes but, for now, let's go with a sphere. There's two types of spheres, ico spheres and uv spheres. I usually go with UV spheres because I think they're easier to unwrap. </p><p><img src=\"https://i.imgur.com/E7IRFW0.png\"></p><p>Check out the comparison above for a visual aid.</p><p><img src=\"https://i.imgur.com/xEluAWb.png\"></p><p>Whenever you create a new object it'll give you some options to the bottom left (actually for most operations). This happens for creating objects but ALSO for unwrapping, knife tool and so forth. When you use a new tool, check that section out for any options you might be able to use to your advantage.</p><p>For now, you can make the amount of rings and segments (horizontal and vertical) whatever you want. Higher means more high poly, of course. For the style I do I usually go between 8-12.</p><p>Now that you have your sphere, move it and scale it (with the S key) to fit the reference image behind it!</p><p><img src=\"https://i.imgur.com/7v4ohkK.png\"></p><p>And now, I want you to delete half of it!</p><h3>Step 3: Using modifiers!</h3><p>Because we only need half! Why would we model a perfectly symmetrical model fully? We only need to model one half of it. </p><p>First, let's move to Edit Mode (Tab).</p><p>Now, how do we delete half of Kirby's head? There's various ways, one of them is using seams (putting a seam along the middle) and then selecting with CTRL + L but a much easier way is to simply change the viewport shading to \"Wireframe\". Which lets you select THROUGH objects, which you can't do in \"Solid\" (the default).</p><p><img src=\"https://i.imgur.com/AD4zPcJ.png\"></p><p>Pressing the Z key on your keyboard will instantly switch from Solid to Wireframe (and back). Alt + Z for \"Texture\" mode, but since we don't have a texture yet, he'll just show up white.</p><p><img src=\"https://i.imgur.com/atX6gfW.png\"></p><p>In Edit Mode pressing the button above will also do the same, except this also works in both Solid and Texture mode. </p><p>Secondly, to be able to select faces (the rectangles/triangles that make up your model) you'll want to set it to face select mode.</p><p><img src=\"https://i.imgur.com/zDryIeV.png\"></p><p>Press the B key to rectangle select objects (this works in any window/mode) and then select half the circle like so: </p><p><img src=\"https://i.imgur.com/FnOJtXW.png\"></p><p>Then, press Del! And half the circle is gone, now what? Well, let's take a look at the properties window. Do you remember where the modifier button/tab is? It's the little wrench. Click said wrench and \"Add Modifier\".</p><p><img src=\"https://i.imgur.com/GDHgTLu.png\"></p><p>Pick the mirror one!</p><p><img src=\"https://i.imgur.com/Y4Bfrmi.png\"></p><p>This little menu pops up and gives you various options. <strong>Merge</strong> will merge any vertices that are close enough together on the enabled axes (plural axis). Clipping will actively set vertices that cross the border over the axis back to the middle point and will merge them too (as in, nothing can pass the middle). For Kirby both of these will be useful.</p><p>The options labeled at the top determine whether or not this modifier (the mirroring) will be visible in the various view modes of Blender. The camera is for rendering, the eye for 3D view's object mode and the block with vertices on it is for Edit Mode. </p><p>The last options enables whether or not you may select and edit the mirrored vertices. If you enable this editing the mesh on either side of the mirroring line will affect the other half, which can also be very useful. I usually have all of these options turned on.</p><p><img src=\"https://i.imgur.com/sR2pmRL.png\"></p><p>Now you should have another perfectly mirrored sphere! And now you know why you had to delete half of the sphere, if the whole sphere was there you'd have two spheres inside of each other.</p><p>Leaving this modifier on let's move on to the next step...</p><h3>Step 4: Modifying Shapes!</h3><p>Now that we know how to add shapes and objects we can repeat this process for Kirby's arms and feet! </p><p>Set your cursor somewhere far right of Kirby and create another sphere.</p><p><img src=\"https://i.imgur.com/5Azy5s6.png\"></p><p>This sphere should also be showing up to the left of Kirby (because of the mirroring). Slice this sphere in half, too, either vertically or horizontally. If horizontally, make sure that it's rotated in such a way that the hollow side is facing Kirby.</p><p><img src=\"https://i.imgur.com/O1Ax4Lg.png\"></p><p>Now, move this hemisphere into Kirby's body while looking at the reference art that's behind our model until the curves match the art as appropriately as possible. </p><p><img src=\"https://i.imgur.com/NtlQOiB.png\"></p><p>We're now going to sort of \"bend\"the sphere to fit the reference art's curves even better.</p><p>Enter \"Proportional Editing\", basically it's editing parts of a model with a magnet attached. The magnet will pull parts of the model that are close (and connected, if enabled) with it. You can change how far it'll pull and how hard it'll pull too.</p><p><img src=\"https://i.imgur.com/tHAMgUQ.png\"></p><p>After this is enabled select any part of the model and move it around, you'll see that things are moving with it! To change the radius of effect roll your mouse wheel up or down. Play with it a little, get a feel for it. This'll be very useful VERY often.</p><p>Secondly, there's something called \"ring select\". This is basically selecting a whole ring of vertices/edges/faces if they're connected in a loop. Hold Alt while selecting anything and it'll attempt to select a whole ring, try it on the edge of your half circle. The result should look like this: </p><p><img src=\"https://i.imgur.com/hXT0YBp.png\"></p><p>Proportional editing ALSO works with scaling and rotation, not just movement. So scale that end of the hemisphere up a bit and maybe pull the most outward vertex of the hemisphere a bit also, as you see fit until you get something that fits the reference art in the back.</p><p><img src=\"https://i.imgur.com/wFySqvO.png\"></p><p>Don't forget that you can see through your model if you set it to wireframe mode (Z key)!</p><p>Zooming out, you'll see that we now have not just a head, but also two stubby arms! </p><p>Last up is the feet! The same process applies EXCEPT we're going to have to do this from the side. Look up some more reference of Kirby and what his feet look like from the side!</p><p><img src=\"https://i.imgur.com/GKFWMFv.png\"></p><p>There are various ways to tackle the feet. In the image above I created another sphere, flattened it while looking at the reference in the back and pulled the front forward while looking at the model from the side.</p><p>Other ways include using a cylinder instead of a sphere.</p><p><img src=\"https://i.imgur.com/Zyq8Lsm.png\"></p><p>Feel free to also squish in parts of the foot to match what you think the feet should look like as well as possible.</p><p>For an easier time editing the foot you may want to hide other parts of the model. You can select whatever you want through rectangle select OR by selecting a part of the model -&gt; CTRL + L. CTRL + L will select everything connected to what you just selected (unless interrupted by a seam, but we will get back to seams later). </p><p>After selecting something press H to hide it. Press Alt + H to unhide it. Press SHIFT + H to hide everything EXCEPT what you just selected. This works in object mode and edit mode.</p><p><img src=\"https://i.imgur.com/PxE4bZ0.png\"></p><p>Your model should look a little bit like this now! A fully featured Kirby! But, wait, why is mine brown?!</p><h3>Bonus: MatCap and other tricks!</h3><p>Here are some tricks I use to make life slightly easier when using Blender:</p><p><strong>MatCap display </strong> - MatCap stands for material capture. You can apply these materials to your model when looking at them for something that might be a bit more pleasant to look at (in \"solid\") instead of that default blender gray. Press N to open up the display menu in the 3D view.</p><p><img src=\"https://i.imgur.com/nzNFIz2.png\"></p><p>Under \"Shading\", it'll say Matcap. Tick that and it'll give you a selection of materials you can apply to your model. That brown one is a very often used one.</p><p><strong>Flat vs. Smooth Shading </strong>- Flat Shading (the default) on the right and Smooth shading on the left.</p><p><img src=\"https://i.imgur.com/lVOjNlv.png\"></p><p>To change which way your object is shaded, select your object and press the space bar. Then type \"Shade Smooth\" or \"Shade Flat\" depending on which you want. Press Enter to execute.</p><p>These options are also accessible from the \"Shading / UVs\" menu in Edit Mode. </p><p><img src=\"https://i.imgur.com/RGFBR4a.png\"></p><h3>Outro</h3><p>It's been another long tutorial, but I hope you guys got through it alright. Again, don't fret to ask questions and send me your feedback! Next time we'll be tackling the texturing of our favorite pink puffball, I hope to see you all again then!</p><p>Here's a sneak peek at the finished result!</p><p><img src=\"https://i.imgur.com/J0RpHjO.png\"></p><p><em>(This file is also in the attachment)</em></p>","min_cents_pledged_to_view":1,"post_type":"text_only","published_at":"2018-05-10T03:58:37+00:00","title":"Blender Overview #2","url":"https://www.patreon.com/posts/blender-overview-18702749"},"id":"18702749","relationships":{"attachments":{"data":[{"id":"2166023","type":"attachment"}]},"campaign":{"data":{"id":"1153441","type":"campaign"},"links":{"related":"https://www.patreon.com/api/campaigns/1153441"}},"user_defined_tags":{"data":[{"id":"user_defined;3d model","type":"post_tag"},{"id":"user_defined;art","type":"post_tag"},{"id":"user_defined;low poly","type":"post_tag"},{"id":"user_defined;tutorial","type":"post_tag"}]}},"type":"post"},{"attributes":{"content":"First off, thanks for pledging and I hope I can make it worth your while.<p>Secondly, there's a few things you should know if you're interested in the stuff I make! </p><p>First is that there's a <strong>discord server</strong>. It's mostly based around my main project (MMBN3D) but you're free to discuss creating art and anything else I do in there. You can also get help with your own art there anytime, really. It's a friendly community.</p><p>Patrons get special roles! Discord server link: <a href=\"https://discord.me/mmbn3d\" rel=\"nofollow noopener\" target=\"_blank\">https://discord.me/mmbn3d</a> </p><p>The second is that I <strong>stream very regularly</strong>! </p><p>I stream modeling, game development and everything in between! Here's a link: <a href=\"http://picarto.tv/heatphoenix\" rel=\"nofollow noopener\" target=\"_blank\">http://picarto.tv/heatphoenix</a>. If you're in the discord or follow me on social media you'll be notified when I start but you can also follow me on Picarto TV itself to get email notifications!</p><p>Hopefully see you guys soon in one of these two places! <em>Thanks!</em></p>","min_cents_pledged_to_view":0,"post_type":"text_only","published_at":"2018-05-06T23:02:40+00:00","title":"Patrons! Some info for you!","url":"https://www.patreon.com/posts/patrons-some-for-18647939"},"id":"18647939","relationships":{"attachments":{"data":[]},"campaign":{"data":{"id":"1153441","type":"campaign"},"links":{"related":"https://www.patreon.com/api/campaigns/1153441"}},"user_defined_tags":{"data":[{"id":"user_defined;announcement","type":"post_tag"},{"id":"user_defined;info","type":"post_tag"}]}},"type":"post"},{"attributes":{"content":"<strong>What you will need:</strong><ul> <li><a href=\"https://www.blender.org/download/\" rel=\"nofollow noopener\" target=\"_blank\">Blender</a></li> <li>A 3-button mouse </li> <li>Preferably a keyboard with a numpad</li></ul><p><br></p><h3><strong>Intro</strong></h3><p>Blender. That seemingly insurmountable challenge of a software. Blender can seem extremely obtuse (and it is) but we're going to tackle it step by step! By the end of this you'll be able to find where everything and will understand most of the tools needed to make a 3D model from scratch!</p><p>I'm mostly covering things that <em>I </em>use often. I may skip things that I don't deem to be too important in starting you guys up, but don't deny yourself your own curiosity. Click around! Ask (me) questions!</p><p>Let's start by opening up Blender.</p><p><img src=\"https://i.imgur.com/wDYV6DK.png\"></p><p><em>The default start up file. </em></p><p>Your blender should look basically like this. My Blender is skinned so the colors may be a little different from yours.</p><p>Separating the UI of the start up screen up into sections we end up with this view.</p><p><img src=\"https://i.imgur.com/0QZrhgr.png\"></p><p><em>The blender start up dialog</em></p><p>I've outlined this dialog and numbered every section. Every section of this tutorial will follow a similar format.</p><p>1. The start up dialog. This will appear every time you start Blender. The image at the top changes every update.</p><p>2. Your recently opened files! There might not be anything there for you yet.</p><p>3. The rest of blender! Click anywhere here to close the start up dialog and get to work on the default file.</p><p>For now, just click anywhere outside the startup dialog and you'll be able to see your entire workspace.</p><h3>Overview</h3><p>This is what you'll be seeing most of the time! One important thing is that the Blender UI is extremely malleable. You can change the sizes of each window by dragging the sides of them whichever way. By clicking the icons at the top right of each section you can even turn them into different types of windows, but more on that later.</p><p><img src=\"https://i.imgur.com/VjLSiBR.png\"></p><h3>1. The <strong>3D view</strong></h3><p>This is where the action takes place. Here you'll see a 3D representation. This menu offers a wealth of possibilities but let's start with some basic and extremely necessary ones:</p><ul> <li>Rotate the camera by pressing and holding the middle mouse button (mouse wheel) and moving the mouse.</li> <li>Zoom in and out by rolling the mouse wheel up and down</li> <li>Right click and object to select it (orange outline)</li></ul><p><br></p><ul> <li>Right click, hold and drag to move an object in 3D space. Left click  (or enter) to place the object</li> <li>Press the 'G' key while selecting something to also move an object in 3D space. </li> <li>Press the 'R' key while selecting something to rotate the object</li> <li>Press the 'S' key while selecting something to scale it</li> <li>Press either the X, Y or Z key to lock movement to an axis. Left click (or enter) to place the object (or apply the changes you've made). This works for all of the previous functions (and many more than rely on the axes)</li></ul><p>The second important thing about the 3D view are the modes. </p><p><img src=\"https://i.imgur.com/caOwklH.png\"></p><p>I will discuss these in detail in another section, but the short of it is that pressing Tab will switch mode in the 3D view. There are various modes and they basically are different ways of looking at your 3D model.</p><p>Pressing the \"T\" key will (toggle) hide the left menu (numbered 5). Pressing \"N\" will do the same thing for the \"Display\" menu. The display menu has various options for changing the way things are displayed in the 3D view. More on this later.</p><p>The 3D view also lets you quickly look at your model from various viewpoints using the numpad.</p><p>Numpad Key - View</p><ul> <li>1 - Front</li> <li>3 - Side</li> <li>7 - Top</li> <li>9 - Reverse from current view (Front -&gt; Back, Top -&gt; Bottom etc.)</li> <li>4 - Rotate one step left</li> <li>5 - Rotate one step right</li> <li>2 - Rotate one step down</li> <li>8 - Rotate one step up</li></ul><p>Lastly, pressing 5 on the numpad switches between perspective view and orthographic view and vice versa.</p><h3>2. The <strong>Menu bar</strong></h3><p>This menu should look familiar. The most important parts of this menu are contained within the File menu and the drop-down that says \"Default\" by default. I'll call that the \"perspectives\" drop-down. </p><p><img src=\"https://i.imgur.com/9aAQB0T.png\"></p><p>File contains the following options.</p><p><img src=\"https://i.imgur.com/JzzibGT.png\"></p><p>Most are self-explanatory but I will explain the following as their uses are important but non-obvious.</p><ul> <li>Append: This allows you to take another blend file (a 3D model or scene saved in the Blender file format) and add parts of it to the current file</li> <li>Import: Open a non-blender file format 3D model into blender. There are various file formats you may open this way. There exist plugins to extend this list (ex. .obj, .stl, .fbx and so on)</li> <li>Export: Same as import, except the other way around</li></ul><p>The perspectives drop-down can be clicked for a list of default perspectives Blender has.</p><p><img src=\"https://i.imgur.com/NHLC1rU.png\"></p><p>I'm not going to go into details on what each perspective does, but you can imagine their uses from the names alone. You can also click on them and then return to the previous perspective by clicking on \"Default\".</p><h3>3. The Outliner</h3><p>The <strong>outliner </strong>lists all objects in the scene (read: in your blender file, for this situation). For the default scene it's just the 3 you can see in your 3D view. Clicking on an object in the list will select it in the 3D View. Clicking the eye will hide it in 3D View and clicking the pointer will make the object immutable. Clicking the camera will toggle rendering on that object (the 3D View is NOT rendering. It's a kind of preview of your 3D model).</p><p><img src=\"https://i.imgur.com/WkCmPbh.png\"></p><p>There is one of each of these for every object in your scene.</p><h3>4. The <strong>properties window</strong> </h3><p>The <strong>properties window </strong>shows the properties of the currently selected object. </p><p><img src=\"https://i.imgur.com/yNmLIr2.png\"></p><p>Every button on this strip of buttons shows the properties of a different aspect of the currently selected object. The available buttons will differ per object (a camera won't have a \"materials\" header).</p><p>I'll list a few of the most important ones</p><p><img src=\"https://i.imgur.com/VTaKdFv.png\"></p><p><em>Render settings </em>- Kind of self-explanatory. But you can also \"remap time\", this basically makes animations slower of faster when viewing them in Blender and change the displayed frame rate of animations here.</p><p><img src=\"https://i.imgur.com/AEZPtqS.png\"></p><p><em>Modifiers </em>- Modifiers are basically operations you can apply to an object for some kind of effect. Sounds pretty vague, but that's because it could really be anything. Do you want your model to be mirrored so you only have to model half of a symmetrical object? That's a modifier. Do you want to smooth your model automatically? That's a modifier.</p><p><img src=\"https://i.imgur.com/0cY7QVD.png\"></p><p><em>Full list of modifiers in Blender</em></p><p>Even a skeleton is actually a modifier! All applied modifiers are visible here.</p><p><img src=\"https://i.imgur.com/b1tuByc.png\"></p><p><em>Armature settings and bone settings</em> - These won't be visible if you're still in the default blender file, but if you're looking at a file with a skeleton these let you change various settings.</p><p>Once we get to rigging a model I'll delve into these extensively, for now, just remember where they're at!</p><p><img src=\"https://i.imgur.com/dy9iCyS.png\"></p><p><em>Materials and textures </em>- These are important if you want to get into rendering your models in Blender. For what we'll be doing (and the models I make in general) this isn't all that important. In fact, if I ever do rendering it'll be a separate tutorial altogether. But again, remember where these two are. If you do want to render, you'll need to set your textures/materials here or the model will just show up pitch black. </p><h3>5. The Toolbox</h3><p>This window (which you can hide with the \"T\" key for extra space in the 3D view). This menu can be popped out for a variety of windows (3D View, UV/Texture window, Weight painting).</p><p>The options here will change dynamically with whatever menu it's popped out with. Most, if not all the options in these menus can usually be approached with either hotkeys or by pressing the Space bar and typing in what you're looking for.</p><h3>6. The Timeline</h3><p>Basically the timeline that animations go through. Keyframes show up as yellow lines, current time is the green line. This'll become a lot more important when we start animating things, but for now it's not very useful. Feel free to drag the edges of it down to give more space to the other menus in view.</p><h3>Modes</h3><p>As stated in  <strong>1. The 3D view</strong> there are several modes that the 3D View can switch to. You can switch modes either by press Tab (it cycles through the list) or by pressing the drop down and the bottom of the 3D View.</p><p><img src=\"https://i.imgur.com/eaqvFe3.png\"></p><p>Depending on what object you have selected the modes you may switch to will differ. On a \"mesh\" object (like the cube, or maybe a character model) you'll have to modes as shown above. </p><p><em>Object Mode </em>- the default mode, here you can shift an entire model around. Rotate it. Set various options pertaining to the entire object. Change which object you're currently working with and merge entire objects.</p><p><em>Edit Mode</em> - the mode where you actually change the object itself, hence \"edit mode\". The cube's display format will also change accordingly.</p><p><img src=\"https://i.imgur.com/hGLUq1W.png\"></p><p>In this mode you can add vertices, faces and change them as you please. On the left side of the above image you can see that the parts that make up the cube are exposed for viewing, in this case by showing us dots (the vertices) and the lines (edges) that connect them.</p><p>Sometimes you might want to be able to see the vertices, sometimes you might only want to see the edges and sometimes you will want to be able to change directly the faces (triangles and quads in a 3D model).</p><p><img src=\"https://i.imgur.com/5jpeCzk.png\"></p><p>We call these \"selection modes\". The first is vertex select, the second is edge select and the third is face select. As the names imply, clicking each button will let you select one type of object or the other inside of your model.</p><p>Other than that, in Edit Mode you are able to use all the shortcuts we learned in Object Mode as well. Right click to select, right click and drag to move. \"G\" key to move and X, Y, or Z to lock movement to an axis and so forth. </p><p>There are many more options in this mode as well, but we'll get back to that when we start modeling our first model (in the next tutorial).</p><p>Pose Mode - In Pose Mode, you can rotate and move bones to create a pose for a skeleton (with or without a 3D model). In this mode you can also save poses as keyframes for animations.</p><p><img src=\"https://i.imgur.com/rHwnzYl.png\"></p><p><em>An example Pose Mode screenshot</em></p><p><em>Weight Paint Mode </em>- Here you can \"paint\" over the model to define which part of the model should be affected by each bone in the skeleton. You can do this by painting over the vertices (from the camera's view) or you can select faces on which to paint. You can also just set a certain value to a certain (selected) part of the model by pressing Shift + K. The brush settings are on the left during Weight Paint mode.</p><p><img src=\"https://i.imgur.com/hlptGJa.png\"></p><p><em>An example weight paint mode screenshot</em></p><p><br></p><p>Lastly, I would like to talk about the windows in Blender in general. All these windows that I've been discussing can actually be changed into any other type of window at will! There are also some windows that aren't visible by default and must first become visible (by changing one of the on-screen windows) before use.</p><p>You can do this by clicking the dark gray square with an icon and selecting another option.</p><p><img src=\"https://i.imgur.com/Sd06Nz8.png\"></p><p>Try changing the properties window (number 4) into the \"UV/Image Editor\" window.  It should look something like this: </p><p><img src=\"https://i.imgur.com/jLJTI3N.png\"></p><p>It's empty because we haven't unwrapped the model yet. Unwrapped UVs are a 2D representation of your model. You literally unwrap your model to be able to paint over it (for texturing). To see unwrapped UVs one must first unwrap a model (\"U\" key in Edit Mode) and then have this window open while in Edit Mode. The parts of the model that are selected will show up in this window. More detail on this when we texture a model.</p><p>With this knowledge in mind you can re-order Blender to have a setup that <em>you </em>find comfortable.</p><h3>Outro</h3><p>This concludes part one of my Blender Overview series of posts. In #2 we will attempt to make a simple model to put our newfound Blender knowledge to test, but before you do that tutorial please run through this tutorial and make sure to ask me questions about anything that might be unclear. I do wonder what we'll be modeling...</p><p>Modeling can be fun and a very liberating creative experience, don't be afraid to ask questions!</p><p>Until next time!</p>","min_cents_pledged_to_view":1,"post_type":"text_only","published_at":"2018-05-04T00:58:19+00:00","title":"Blender Overview #1","url":"https://www.patreon.com/posts/blender-overview-18580614"},"id":"18580614","relationships":{"attachments":{"data":[]},"campaign":{"data":{"id":"1153441","type":"campaign"},"links":{"related":"https://www.patreon.com/api/campaigns/1153441"}},"user_defined_tags":{"data":[{"id":"user_defined;3d model","type":"post_tag"},{"id":"user_defined;beginners","type":"post_tag"},{"id":"user_defined;blender","type":"post_tag"},{"id":"user_defined;low poly","type":"post_tag"},{"id":"user_defined;tutorial","type":"post_tag"}]}},"type":"post"},{"attributes":{"content":"So, I just wanted to tell you guys what's coming for this month.<p>TWO tutorials on using Blender to do low-poly modeling. One intro to blender and how to use it step-by-step and one tutorial actually applying that knowledge. They're meant to be done fairly quickly after each other so expect them both shortly after each other.</p><p>First one goes up tomorrow!</p><p>Originally I had meant to model the Mega Man Zero buster as a tutorial model but as I was modeling it I realized it was far too complex for first timers. But since I modeled this thing for you guys, you guys can have the files for it if you want!</p><p><img src=\"https://i.imgur.com/tSMPl3O.gif\"></p><p>(See attachment!)</p><p>Thanks for the support so far!</p>","min_cents_pledged_to_view":1,"post_type":"text_only","published_at":"2018-05-03T00:08:20+00:00","title":"Coming up this week!","url":"https://www.patreon.com/posts/coming-up-this-18567829"},"id":"18567829","relationships":{"attachments":{"data":[{"id":"2142907","type":"attachment"}]},"campaign":{"data":{"id":"1153441","type":"campaign"},"links":{"related":"https://www.patreon.com/api/campaigns/1153441"}},"user_defined_tags":{"data":[]}},"type":"post"},{"attributes":{"content":"So, like, you might be wondering \"What's on the menu first, for this here patreon?\" and my answer is... that's up to you!<p>(I do have two things in the works, one for everyone, one for patrons only!)</p><p>So what do we start with!?</p><p>(As always, please let me know how you feel about things/things that can be improved!)</p>","min_cents_pledged_to_view":0,"post_type":"poll","published_at":"2018-04-07T16:44:25+00:00","title":"First Poll (FIX)!","url":"https://www.patreon.com/posts/first-poll-fix-18036635"},"id":"18036635","relationships":{"attachments":{"data":[]},"campaign":{"data":{"id":"1153441","type":"campaign"},"links":{"related":"https://www.patreon.com/api/campaigns/1153441"}},"user_defined_tags":{"data":[]}},"type":"post"},{"attributes":{"content":"<img src=\"https://i.imgur.com/7nVDDOx.png\"><p><strong>What you will need:</strong></p><ul> <li><a href=\"https://www.blender.org/download/\" rel=\"nofollow noopener\" target=\"_blank\">Blender</a></li> <li>A 2D art program with layer support (<a href=\"https://www.dotpdn.com/downloads/pdn.html\" rel=\"nofollow noopener\" target=\"_blank\">Paint.NET</a> is free)</li> <li>Limitless imagination</li> <li>A 3-button mouse</li> <li>The attached zip contains:    <ul> <li>A 3D model</li> <li>A texture</li> <li>A UV map</li> </ul> </li></ul><p> </p><h3><strong>Intro</strong></h3><p>So, you know these guys?</p><p><img src=\"https://i.imgur.com/TM5fMhP.png\"></p><p>Yeah, NormalNavis. I'm going to use NormalNavis in this post for two things, 1) To teach you how to recolor, read and edit texture maps for 3D models and 2) For you to have something to try all this on!</p><p>We'll be following 5 steps during this tutorial:</p><ol> <li>Open a 3D model in Blender</li> <li>Understand the UV map</li> <li>Open the texture and UV map in a 2D art program</li> <li>Edit the texture map</li> <li>Share your masterpiece</li></ol><p><img src=\"https://i.imgur.com/lYmFvSt.png\"></p><p><em>Exhibit A: Normie</em></p><p>This is the default NormalNavi we all know and love (and that I modeled, thanks to the contributions to the tip jar by the community).</p><p> And this...  </p><p><img src=\"https://i.imgur.com/hlPpRaz.png\"></p><p>...is the texture (and UV map). </p><p>After unwrapping a modeler might paint over these parts (while looking at what they correspond to) to create the texture for a low poly model! And that's exactly what we're going to do.</p><p><br></p><h3><strong>Step One: Opening the Model</strong></h3><p>Now open up Blender and let's load up the model  (<strong>File &gt; Open &gt; NormalNavi.blend</strong>) .</p><p>It should look something like this:</p><p><img src=\"https://i.imgur.com/DPxEnDB.png\"></p><p><em>You can resize all the panels and panes by dragging the borders!</em></p><p>In Blender you can zoom in/out with the mouse wheel and you can rotate the model by pressing the mouse wheel and moving the mouse. You can pan the view by holding the mouse wheel and the SHIFT key and then moving the mouse.</p><p>However, the model may be purple/pink for you as the file location is considered to be what was on my PC and not what may be the organization on yours.</p><p>If this is the case,  </p><ol> <li>Right-click the model in the left pane (he'll get an orange border)</li> <li>Press <strong>tab</strong>. The texture window to the left should show the outlined shapes on the UV map.</li> <li>With your mouse hovering over the UV map, press <strong>A</strong>. This will select all the shapes on the UV map.</li> <li>Click <strong>Image &gt; Open Image</strong> to select your file!</li></ol><p> Now you should be able to see the NormalNavi in all his green glory. </p><p><img src=\"https://i.imgur.com/JPFqPK8.png\"></p><p><em>Visual instructions for if your Blender does not show the model's texture</em></p><p> </p><h3><strong>Step Two: Reading the UV Map</strong></h3><p>Pressing tab while selecting the NormalNavi (orange outline) will swap between object mode and edit mode. In edit mode you can select parts of the NormalNavi (with right click) and they'll show up highlighted on the right pane.</p><p><img src=\"https://i.imgur.com/DrWaqEv.png\"></p><p>So, looking at that texture pane to the right we can now see what we should edit if we want to change his legs. Let's open up our texture.</p><p> </p><h3><strong>Step Three: Opening the Texture (and UV map)</strong></h3><p>First, open up normtex.png in your favorite image editing tool. Then, add a second layer above this base image. Add normnaviuv.png as that top layer.</p><p><img src=\"https://i.imgur.com/ZnB4KV3.png\"></p><p>It should look something like that on the right at the end. Make sure to navigate back to the bottom layer when actually painting. Those black lines are the outlines of the \"UV map\". Basically a mapping of how the 3D model unfolds onto a 2D space (reverse papercraft).</p><p> </p><h3><strong>Step Four: Editing the Texture</strong></h3><p>From here on out we can edit whatever we want. Let's change the colors and put them on the model as an example. Just a simple recolor.</p><p><img src=\"https://i.imgur.com/IplLKHL.png\"></p><p>You can do this, of course, as many times as you want so you may want to make a small change -&gt; put it to the model -&gt; next change until you're satisfied.</p><p>Save your edited texture to normtex.png (the file that Blender considers the texture for NormalNavi).  </p><ol> <li>In the window with the UV layer, paint the texture layer under the UV layer</li> <li>Copy the full texture layer</li> <li>In the window/file with just the texture, paste the texture layer and save the file</li></ol><p><img src=\"https://i.imgur.com/lGlvCac.png\"></p><p><em>Ta-da! Char's Custom NormalNavi</em></p><p>Make as many changes as you like! If you want to save it under a different name so you can have different textures. Then you can swap them by doing  <strong>Image &gt; Open Image</strong>  as described above. </p><p>For speedy updates to the model keep the texture open twice, once with the UV layer and once without (so you can just copy and paste it).</p><p><br></p><h3><strong>Step Five: Sharing your Masterpiece</strong></h3><p> </p><p>So you want to take a screenshot of your fine work, but all the Blender lines and grids are in the way. Here's how to get a clean capture:</p><ol> <li>With your mouse hovered over the 3D view of your model, press the <strong>N</strong> key</li> <li>In the new menu, unfold the \"&gt; Display\" tab and tick \"Only Render\"</li> <li>Press <strong>N</strong> once again to collapse the menu</li></ol><p><img src=\"https://i.imgur.com/YFZ1X3B.png\"></p><p>I hope this was a clear and informative post and that you had fun making your own NormalNavi. Be sure to show them to me when you get the chance!</p><p><img src=\"https://i.imgur.com/6jnsB7R.png\"></p><p> </p><h3><strong>Outro</strong></h3><p>If you'd like more posts like this and on other topics please consider supporting this patreon. It helps me do fun stuff like this! For example a tutorial on how to texture paint like I do or how to pose and animate models!</p><p>As always, please let me know what you think either here or any other place. If you need help with any of the steps, try the community discord of MMBN3D: <a href=\"http://discord.me/mmbn3d\" rel=\"nofollow noopener\" target=\"_blank\">discord.me/mmbn3d</a> </p><p><em><strong>Thanks for reading!</strong></em></p>","min_cents_pledged_to_view":0,"post_type":"text_only","published_at":"2018-04-07T03:39:27+00:00","title":"How To Make Your Own NormalNavi!","url":"https://www.patreon.com/posts/how-to-make-your-17809985"},"id":"17809985","relationships":{"attachments":{"data":[{"id":"2051127","type":"attachment"}]},"campaign":{"data":{"id":"1153441","type":"campaign"},"links":{"related":"https://www.patreon.com/api/campaigns/1153441"}},"user_defined_tags":{"data":[{"id":"user_defined;3d model","type":"post_tag"},{"id":"user_defined;art","type":"post_tag"},{"id":"user_defined;low poly","type":"post_tag"},{"id":"user_defined;texture","type":"post_tag"},{"id":"user_defined;tutorial","type":"post_tag"}]}},"type":"post"},{"attributes":{"content":"Well, as you are all here and have pledged (to be able to see this post) you must be thinking \"launching? But it's already up!\". Well, see, I haven't actually promoted this patreon anywhere, you guys are the EARLY ADOPTERS (whoa).<p>So check this out, I'm trying to make a tiny promo video/animation to launch with and get people excited but animation is hard, so I thought it'd be interesting for you guys to maybe see the process:</p><p>1.</p><p><img src=\"https://i.imgur.com/MsY9Gxu.gif\"></p><p>2. </p><p><img src=\"https://i.imgur.com/gMPtSAs.gif\"></p><p>3.</p><p><img src=\"https://i.imgur.com/7Y52dBh.gif\"></p><p>4.</p><p><img src=\"https://i.imgur.com/6QAqGzk.gif\"></p><p>And the current version!</p><p><img src=\"https://i.imgur.com/0DdAKEF.gif\"></p><p><br></p><p>And that's it for now. I'm thinking of putting up the Hardboiled Heavy model up for patrons to download after I launch, how does that sound? </p><p>Thank you again for pledging to me and look forward to the coming weeks! And hey, definitely let me know what you think and if there's something you think I could do to attract more patrons as well.</p>","min_cents_pledged_to_view":1,"post_type":"text_only","published_at":"2018-03-13T21:52:44+00:00","title":"Working on promoting and launching the patreon!","url":"https://www.patreon.com/posts/working-on-and-17539356"},"id":"17539356","relationships":{"attachments":{"data":[]},"campaign":{"data":{"id":"1153441","type":"campaign"},"links":{"related":"https://www.patreon.com/api/campaigns/1153441"}},"user_defined_tags":{"data":[{"id":"user_defined;3d model","type":"post_tag"},{"id":"user_defined;3dcg","type":"post_tag"},{"id":"user_defined;animation","type":"post_tag"},{"id":"user_defined;art","type":"post_tag"},{"id":"user_defined;blender","type":"post_tag"}]}},"type":"post"}],"included":[{"attributes":{"avatar_photo_url":"https://c10.patreonusercontent.com/3/eyJ3IjoyMDB9/patreon-media/p/campaign/1153441/2bb9286fb3de4bf295ec96f736ed5acb/1?token-time=2145916800&token-hash=OU5ZEIepNoUA_0-h33mbGHOPb_uJYpHietb-h8-0PV4%3D","cover_photo_url":"https://c10.patreonusercontent.com/3/eyJ3IjoxOTIwfQ%3D%3D/patreon-media/p/campaign/1153441/96f47bdb12a143b8b33dda66e727ee92/3?token-time=2145916800&token-hash=HhmRpc7oILMX_vJNmvgh37tWZjdKwebhZ0J0MPfxh1o%3D","created_at":"2017-08-09T19:13:10+00:00","creation_count":31,"creation_name":"3D models, video games and tutorials!","discord_server_id":"244669887367086080","display_patron_goals":false,"earnings_visibility":"public","image_small_url":"https://c10.patreonusercontent.com/3/eyJoIjo2NDAsInciOjY0MH0%3D/patreon-media/p/campaign/1153441/96f47bdb12a143b8b33dda66e727ee92/3?token-time=2145916800&token-hash=B3z5BNYEAUK5zGPXkURFvQO6FUTCTzRt2lxT7yrSRZc%3D","image_url":"https://c10.patreonusercontent.com/3/eyJ3IjoxOTIwfQ%3D%3D/patreon-media/p/campaign/1153441/96f47bdb12a143b8b33dda66e727ee92/3?token-time=2145916800&token-hash=HhmRpc7oILMX_vJNmvgh37tWZjdKwebhZ0J0MPfxh1o%3D","is_charge_upfront":true,"is_charged_immediately":true,"is_monthly":true,"is_nsfw":false,"is_plural":false,"main_video_embed":null,"main_video_url":null,"name":"HeatPhoenix","one_liner":null,"outstanding_payment_amount_cents":0,"patron_count":58,"pay_per_name":"month","pledge_sum":13171,"pledge_url":"/join/heatphoenix","published_at":"2018-03-04T20:52:03+00:00","summary":"Hi there, my name is Zacharia but you probably know me as HeatPhoenix, a game developer and 3D artist. First of all, I want to thank you for looking at this page and considering my Patreon.<br>\n<br>\n<img src=\"https://image.ibb.co/kx7byS/B7KgtK8.gif\"><br>\n<br>You may know me from Mega Man Battle Network 3D, one of my other video game projects or maybe you've just enjoyed checking out my models!<br><br>So what is this Patreon for?\n<br>\n<ol>\n\t<li>Supporting me making new models and game content for you to enjoy!</li>\n\t<li>Special rewards as a thank for you contributing!</li>\n\t<li>Tutorials and instruction on how to create 3D art  in my style and games!</li>\n</ol>\nPledging above the Model S tier even grants you access to my 3D model files! You're free to use them in any non-commercial use case.\n<br>\n<br><img src=\"https://78.media.tumblr.com/e5a2d990663e976a918f71de0ff724ca/tumblr_inline_p8buxj2oMO1qhtzpy_540.png\"><br><br>\nWith enough support I'll be able to keep up modeling high quality 3D models and animations that you can both enjoy and will help me improve my craft. Here are some examples of some models I have made in the past.\n<br>\n<br>\n<img src=\"https://image.ibb.co/e6ouk7/image.png\"><br>\n<br>\nAnd check out some characters I'd LOVE to do with your support! Can you imagine them in 3D dimensions with 100% of my love and attention? And you'd be able to get the files too and check out every angle!<br>\n<br>\n<img src=\"https://image.ibb.co/gbTidS/h_J5_Ur_PG_1.png\"><br>\n<br>\nAgain, thank you for reading and I hope you'll support me in my quest for excellent 3D models.<br><br><em>Profile image by <strong>@Tentawful </strong></em>","thanks_embed":null,"thanks_msg":"Thank you so SO much! You're helping both my dream and (hopefully) yours come true! I don't know if it's because you love the games I make or the art I create but one way or another, we're in for a hell of a ride.<br><br>Let me know if there's anything I can do to make this Patreon even more rewarding for you!","thanks_video_url":null,"url":"https://www.patreon.com/heatphoenix"},"id":"1153441","relationships":{"rewards":{"data":[{"id":"-1","type":"reward"},{"id":"0","type":"reward"},{"id":"1913197","type":"reward"},{"id":"1913537","type":"reward"},{"id":"1913538","type":"reward"}]}},"type":"campaign"},{"attributes":{"background_image_url":null,"cardinality":1,"is_featured":false,"ordinal_number":null,"tag_type":"user_defined","value":"announcement"},"id":"user_defined;announcement","type":"post_tag"},{"attributes":{"name":"kirby.zip","url":"https://www.patreon.com/file?h=19189533&i=2255444"},"id":"2255444","relationships":{"post":{"data":{"id":"19189533","type":"post"},"links":{"related":"https://www.patreon.com/api/posts/19189533"}}},"type":"attachment"},{"attributes":{"background_image_url":null,"cardinality":1,"is_featured":false,"ordinal_number":null,"tag_type":"user_defined","value":"3d model"},"id":"user_defined;3d model","type":"post_tag"},{"attributes":{"background_image_url":null,"cardinality":1,"is_featured":false,"ordinal_number":null,"tag_type":"user_defined","value":"art"},"id":"user_defined;art","type":"post_tag"},{"attributes":{"background_image_url":null,"cardinality":1,"is_featured":false,"ordinal_number":null,"tag_type":"user_defined","value":"texture"},"id":"user_defined;texture","type":"post_tag"},{"attributes":{"background_image_url":null,"cardinality":1,"is_featured":false,"ordinal_number":null,"tag_type":"user_defined","value":"tutorial"},"id":"user_defined;tutorial","type":"post_tag"},{"attributes":{"background_image_url":null,"cardinality":1,"is_featured":false,"ordinal_number":null,"tag_type":"user_defined","value":"news"},"id":"user_defined;news","type":"post_tag"},{"attributes":{"name":"kirbytexture.zip","url":"https://www.patreon.com/file?h=18702749&i=2166023"},"id":"2166023","relationships":{"post":{"data":{"id":"18702749","type":"post"},"links":{"related":"https://www.patreon.com/api/posts/18702749"}}},"type":"attachment"},{"attributes":{"background_image_url":null,"cardinality":1,"is_featured":false,"ordinal_number":null,"tag_type":"user_defined","value":"low poly"},"id":"user_defined;low poly","type":"post_tag"},{"attributes":{"background_image_url":null,"cardinality":1,"is_featured":false,"ordinal_number":null,"tag_type":"user_defined","value":"info"},"id":"user_defined;info","type":"post_tag"},{"attributes":{"background_image_url":null,"cardinality":1,"is_featured":false,"ordinal_number":null,"tag_type":"user_defined","value":"beginners"},"id":"user_defined;beginners","type":"post_tag"},{"attributes":{"background_image_url":null,"cardinality":1,"is_featured":false,"ordinal_number":null,"tag_type":"user_defined","value":"blender"},"id":"user_defined;blender","type":"post_tag"},{"attributes":{"name":"bustertex.zip","url":"https://www.patreon.com/file?h=18567829&i=2142907"},"id":"2142907","relationships":{"post":{"data":{"id":"18567829","type":"post"},"links":{"related":"https://www.patreon.com/api/posts/18567829"}}},"type":"attachment"},{"attributes":{"name":"NormalNaviFiles.zip","url":"https://www.patreon.com/file?h=17809985&i=2051127"},"id":"2051127","relationships":{"post":{"data":{"id":"17809985","type":"post"},"links":{"related":"https://www.patreon.com/api/posts/17809985"}}},"type":"attachment"},{"attributes":{"background_image_url":null,"cardinality":1,"is_featured":false,"ordinal_number":null,"tag_type":"user_defined","value":"3dcg"},"id":"user_defined;3dcg","type":"post_tag"},{"attributes":{"background_image_url":null,"cardinality":1,"is_featured":false,"ordinal_number":null,"tag_type":"user_defined","value":"animation"},"id":"user_defined;animation","type":"post_tag"},{"attributes":{"amount":0,"amount_cents":0,"created_at":null,"description":"Everyone","remaining":0,"requires_shipping":false,"url":null,"user_limit":null},"id":"-1","type":"reward"},{"attributes":{"amount":1,"amount_cents":1,"created_at":null,"description":"Patrons Only","remaining":0,"requires_shipping":false,"url":null,"user_limit":null},"id":"0","type":"reward"},{"attributes":{"amount":100,"amount_cents":100,"created_at":"2017-08-09T20:29:55.227951+00:00","description":"<ul>\n<li>Thank you for supporting me. I really do appreciate that!</li>\n<li>You get access to all Patron exclusive tutorial resources (including model files)!</li>\n</ul>","discord_role_ids":["426165875184369665"],"edited_at":"2018-03-21T23:52:40.546808+00:00","image_url":null,"patron_count":54,"post_count":2,"published":true,"published_at":"2018-03-21T23:52:40.515061+00:00","remaining":null,"requires_shipping":false,"title":"Supporter Man","unpublished_at":null,"url":"/join/heatphoenix/checkout?rid=1913197","user_limit":null},"id":"1913197","relationships":{"campaign":{"data":{"id":"1153441","type":"campaign"},"links":{"related":"https://www.patreon.com/api/campaigns/1153441"}}},"type":"reward"},{"attributes":{"amount":600,"amount_cents":600,"created_at":"2017-08-09T22:40:06.119938+00:00","description":"<ul>\n<li>You get to vote on what project I tackle next!</li>\n</ul>\n<p>AND all previous rewards!!</p>","discord_role_ids":["426165875184369665"],"edited_at":"2018-03-21T23:52:48.065163+00:00","image_url":null,"patron_count":4,"post_count":2,"published":true,"published_at":"2018-03-21T23:52:48.039612+00:00","remaining":null,"requires_shipping":false,"title":"Supporter.EXE","unpublished_at":null,"url":"/join/heatphoenix/checkout?rid=1913537","user_limit":null},"id":"1913537","relationships":{"campaign":{"data":{"id":"1153441","type":"campaign"},"links":{"related":"https://www.patreon.com/api/campaigns/1153441"}}},"type":"reward"},{"attributes":{"amount":1800,"amount_cents":1800,"created_at":"2017-08-09T22:40:06.126076+00:00","description":"<ul>\n<li>You get exclusive access to the actual 3D model files of the models I work on for this Patreon!</li>\n<li>You may use them for any non-commercial purpose you'd like!</li>\n</ul>\n<p> AND all previous rewards! </p>","discord_role_ids":["426165875184369665"],"edited_at":"2018-03-21T23:52:53.462710+00:00","image_url":null,"patron_count":4,"post_count":6,"published":true,"published_at":"2018-03-21T23:52:53.373638+00:00","remaining":null,"requires_shipping":false,"title":"Model S(upporter)","unpublished_at":null,"url":"/join/heatphoenix/checkout?rid=1913538","user_limit":null},"id":"1913538","relationships":{"campaign":{"data":{"id":"1153441","type":"campaign"},"links":{"related":"https://www.patreon.com/api/campaigns/1153441"}}},"type":"reward"}],"meta":{"pagination":{"total":31}}}